balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC12HV752.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR2" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR2" edc:desc="" edc:mask="0xff" edc:name="PR2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T2CON" edc:desc="" edc:impl="0x7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T2CON" edc:nzwidth="8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T2CKPS" edc:desc="" edc:mask="0x3" edc:name="T2CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR2ON" edc:desc="" edc:mask="0x1" edc:name="TMR2ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS" edc:desc="" edc:mask="0xf" edc:name="T2OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2CKPS0" edc:desc="" edc:mask="0x1" edc:name="T2CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS1" edc:desc="" edc:mask="0x1" edc:name="T2CKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="HLTMR1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="HLTMR1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HLTMR1" edc:desc="" edc:mask="0xff" edc:name="HLTMR1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="HLTPR1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="HLTPR1" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HLTPR1" edc:desc="" edc:mask="0xff" edc:name="HLTPR1" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="HLT1CON0" edc:desc="" edc:impl="0x7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="HLT1CON0" edc:nzwidth="8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="H1CKPS" edc:desc="" edc:mask="0x3" edc:name="H1CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="H1ON" edc:desc="" edc:mask="0x1" edc:name="H1ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H1OUTPS" edc:desc="" edc:mask="0xf" edc:name="H1OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="H1CKPS0" edc:desc="" edc:mask="0x1" edc:name="H1CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H1CKPS1" edc:desc="" edc:mask="0x1" edc:name="H1CKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="H1OUTPS0" edc:desc="" edc:mask="0x1" edc:name="H1OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H1OUTPS1" edc:desc="" edc:mask="0x1" edc:name="H1OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H1OUTPS2" edc:desc="" edc:mask="0x1" edc:name="H1OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H1OUTPS3" edc:desc="" edc:mask="0x1" edc:name="H1OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="HLT1CON1" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="HLT1CON1" edc:nzwidth="8" edc:por="---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="H1REREN" edc:desc="" edc:mask="0x1" edc:name="H1REREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H1FEREN" edc:desc="" edc:mask="0x1" edc:name="H1FEREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H1ERS" edc:desc="" edc:mask="0x7" edc:name="H1ERS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="H1ERS0" edc:desc="" edc:mask="0x1" edc:name="H1ERS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H1ERS1" edc:desc="" edc:mask="0x1" edc:name="H1ERS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="H1ERS2" edc:desc="" edc:mask="0x1" edc:name="H1ERS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="9"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1A0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="1" edc:regionidref="sfr0"/>
        <edc:Mirror edc:nzsize="1" edc:regionidref="sfr1"/>
        <edc:Mirror edc:nzsize="3" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="ANSELA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--11-111" edc:name="ANSELA" edc:nzwidth="8" edc:por="--11-111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA5" edc:desc="" edc:mask="0x1" edc:name="ANSA5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="APFCON" edc:desc="" edc:impl="0x17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0-000" edc:name="APFCON" edc:nzwidth="8" edc:por="---0-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="COG1O0SEL" edc:desc="" edc:mask="0x1" edc:name="COG1O0SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COG1O1SEL" edc:desc="" edc:mask="0x1" edc:name="COG1O1SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COG1FSEL" edc:desc="" edc:mask="0x1" edc:name="COG1FSEL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1GSEL" edc:desc="" edc:mask="0x1" edc:name="T1GSEL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="OSCTUNE" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="OSCTUNE" edc:nzwidth="8" edc:por="---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0x1f" edc:name="TUN" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUN0" edc:desc="" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:desc="" edc:mask="0x1" edc:name="TUN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:desc="" edc:mask="0x1" edc:name="TUN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:desc="" edc:mask="0x1" edc:name="TUN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN4" edc:desc="" edc:mask="0x1" edc:name="TUN4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:Mirror edc:nzsize="2" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="-----nss" edc:cname="PMCON1" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PMCON1" edc:nzwidth="0x8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="Read Control bit" edc:mask="0x1" edc:name="RD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="Write Control bit" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="Program/Erase Enable bit" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="PMCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------" edc:name="PMCON2" edc:nzwidth="0x8" edc:por="--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMCON2" edc:desc="" edc:mask="0xff" edc:name="PMCON2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PMADR" edc:desc="" edc:name="PMADR" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMADRL" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PMADRL" edc:desc="" edc:mask="0xff" edc:name="PMADRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
